test/integration/data.psphere.inv/request-2.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:ns0="urn:vim25" xmlns:ns1="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <ns1:Body>
    <ns0:RetrieveProperties>
      <ns0:_this type="PropertyCollector">propertyCollector</ns0:_this>
      <ns0:specSet>
        <ns0:propSet>
          <ns0:type>HostSystem</ns0:type>
          <ns0:all>false</ns0:all>
          <ns0:pathSet>name</ns0:pathSet>
        </ns0:propSet>
        <ns0:objectSet>
          <ns0:obj type="Folder">group-d1</ns0:obj>
          <ns0:selectSet xsi:type="ns0:TraversalSpec">
            <ns0:name>folder_traversal_spec</ns0:name>
            <ns0:type>Folder</ns0:type>
            <ns0:path>childEntity</ns0:path>
            <ns0:selectSet>
              <ns0:name>folder_traversal_spec</ns0:name>
            </ns0:selectSet>
            <ns0:selectSet>
              <ns0:name>datacenter_host_traversal_spec</ns0:name>
            </ns0:selectSet>
            <ns0:selectSet>
              <ns0:name>datacenter_vm_traversal_spec</ns0:name>
            </ns0:selectSet>
            <ns0:selectSet>
              <ns0:name>compute_resource_rp_traversal_spec</ns0:name>
            </ns0:selectSet>
            <ns0:selectSet>
              <ns0:name>compute_resource_host_traversal_spec</ns0:name>
            </ns0:selectSet>
            <ns0:selectSet>
              <ns0:name>host_vm_traversal_spec</ns0:name>
            </ns0:selectSet>
            <ns0:selectSet>
              <ns0:name>resource_pool_vm_traversal_spec</ns0:name>
            </ns0:selectSet>
          </ns0:selectSet>
          <ns0:selectSet xsi:type="ns0:TraversalSpec">
            <ns0:name>datacenter_vm_traversal_spec</ns0:name>
            <ns0:type>Datacenter</ns0:type>
            <ns0:path>vmFolder</ns0:path>
            <ns0:selectSet>
              <ns0:name>folder_traversal_spec</ns0:name>
            </ns0:selectSet>
          </ns0:selectSet>
          <ns0:selectSet xsi:type="ns0:TraversalSpec">
            <ns0:name>datacenter_host_traversal_spec</ns0:name>
            <ns0:type>Datacenter</ns0:type>
            <ns0:path>hostFolder</ns0:path>
            <ns0:selectSet>
              <ns0:name>folder_traversal_spec</ns0:name>
            </ns0:selectSet>
          </ns0:selectSet>
          <ns0:selectSet xsi:type="ns0:TraversalSpec">
            <ns0:name>compute_resource_host_traversal_spec</ns0:name>
            <ns0:type>ComputeResource</ns0:type>
            <ns0:path>host</ns0:path>
          </ns0:selectSet>
          <ns0:selectSet xsi:type="ns0:TraversalSpec">
            <ns0:name>compute_resource_rp_traversal_spec</ns0:name>
            <ns0:type>ComputeResource</ns0:type>
            <ns0:path>resourcePool</ns0:path>
            <ns0:selectSet>
              <ns0:name>resource_pool_traversal_spec</ns0:name>
            </ns0:selectSet>
            <ns0:selectSet>
              <ns0:name>resource_pool_vm_traversal_spec</ns0:name>
            </ns0:selectSet>
          </ns0:selectSet>
          <ns0:selectSet xsi:type="ns0:TraversalSpec">
            <ns0:name>resource_pool_traversal_spec</ns0:name>
            <ns0:type>ResourcePool</ns0:type>
            <ns0:path>resourcePool</ns0:path>
            <ns0:selectSet>
              <ns0:name>resource_pool_traversal_spec</ns0:name>
            </ns0:selectSet>
            <ns0:selectSet>
              <ns0:name>resource_pool_vm_traversal_spec</ns0:name>
            </ns0:selectSet>
          </ns0:selectSet>
          <ns0:selectSet xsi:type="ns0:TraversalSpec">
            <ns0:name>host_vm_traversal_spec</ns0:name>
            <ns0:type>HostSystem</ns0:type>
            <ns0:path>vm</ns0:path>
            <ns0:selectSet>
              <ns0:name>folder_traversal_spec</ns0:name>
            </ns0:selectSet>
          </ns0:selectSet>
          <ns0:selectSet xsi:type="ns0:TraversalSpec">
            <ns0:name>resource_pool_vm_traversal_spec</ns0:name>
            <ns0:type>ResourcePool</ns0:type>
            <ns0:path>vm</ns0:path>
          </ns0:selectSet>
        </ns0:objectSet>
      </ns0:specSet>
    </ns0:RetrieveProperties>
  </ns1:Body>
</SOAP-ENV:Envelope>
